{
    "workExperience": [
        {
          "title": "Morgan Stanley",
          "subtitle":"Technology Analyst Intern",
          "imgSrc": "/morgan.png",
          "description": ["Implemented a full stack application for the Securities Reference Data department using Spring Boot, MongoDB and Angular to monitor milliions of financial events and provide business visibility for non-technical users.", "Interacted with different stakeholders to ensure security, performance and user experience requirements were being met."],
          "date": "May 2024 - Aug 2024",
          "imgSecondarySrc": "/morgan-second.png",
          "tags": ["Java", "Angular", "MongoDB"]
        },
        {
          "title": "Dialogue",
          "subtitle":"Software Engineering Intern",
          "imgSrc": "/dialogue.png",
          "description": ["Played a crucial role in designing and building a new faxing infrastructure for medical practitioners, utilizing FastAPI for the Python backend, AWS PostgreSQL database and React Typescript for the frontend. This infrastructure allowed the company to pivot away from using a 3rd party service and resulted in 700,000$ in yearly savings.", "Contributed to the development of the React Native client-facing application, focusing on building features for the company's new wellness program, allowing users to connect wearables to compete in fitness challenges. This effort required collaboration between design, product and data teams in order to deliver a high quality product that engages users and resulted in high customer satisfaction."],
          "date": "Jan 2024 - Apr 2024",
          "imgSecondarySrc": "/dialogue-second.png",
          "tags": ["Typescript", "React", "Python", "FastAPI", "SQL"]
        },
        {
          "title": "Novatek",
          "subtitle":"Software Engineering Intern",
          "imgSrc": "/novatek.png",
          "description": ["Developed a Python script to automate data migration from legacy software to a web-based version, enabling the team to seamlessly input 20 years worth of client data into the new application. This saved countless hours of manual work and avoided potential errors associated with manually inputting millions of data entries.", "Automated the installation of pharmaceutical software, reducing time from 2 hours to 10 minutes, resulting in a 90% decrease in installation time."],
          "date": "Jul 2023 - Sep 2023",
          "imgSecondarySrc": "/novatek-second.png",
          "tags": ["Python", "SQL"]
        },
        {
          "title": "Deloitte",
          "subtitle":"Solutions Associate Intern",
          "imgSrc": "/deloitte.png",
          "description": ["Collaborated with hiring teams to identify pain points in the hiring process and leveraged Salesforce to design and deploy customized solutions, resulting in a decrease in time-to-hire and improved candidate selection experience.", "Contributed to the entire project lifecycle, including requirement gathering, UI design, backend and frontend development, demonstrating strong ownership and project management skills.", "Attained the Salesforce Administrator Certification within an accelerated timeframe of just 2 weeks, surpassing the average completion time of 6- 12 weeks, showcasing exceptional dedication and aptitude for learning new technologies."],
          "date": "May 2022 - Aug 2022",
          "imgSecondarySrc": "/deloitte-second.png",
          "tags": ["Salesforce", "LWC", "Apex", "SOQL"]
        }
      ],
    "projects": [
        {
          "title": "Engineering Capstone",
          "subtitle":"LLM Generated Article Detector",
          "imgSrc": "/mcgill.png",
          "description": ["Applying a multi-modal machine learning model to accurately detect news articles generated by AI. This technology can help filter through non human article text, images and titles, which can help improve public trust of news sources.",
          "Supervised by Prof. Chengzhi Mao at MILA to conduct research, model training, guidance and publish research findings for machine learning conferences."],
          "date": "Sep 2023 - Apr 2024",
          "imgSecondarySrc": "/capstone-second.png",
          "tags": ["Pytorch", "BeautifulSoup", "XGBoost"]
        },
        {
          "title": "Health Lens",
          "subtitle":"Dialogue Hackathon Winner",
          "imgSrc": "/healthlens.png",
          "description": ["Developped a new full-stack feature for the Dialogue patient app to predict health metrics using smart watch data. The data was processed to generate specific prompts based on an MIT paper and fed to a fine-tuned health LLM to generate predictions on sleep, cardiac health, etc.", "paper that inspired the project: https://arxiv.org/html/2401.06866v1"],
          "date": "Sep 2023 - Apr 2024",
          "imgSecondarySrc": "/healthlens-secondary.png",
          "tags": ["Python", "FastAPI", "Llama", "React"]
        },
        {
          "title": "AI Face Roaster",
          "subtitle":"McGill AI Society Hackathon",
          "imgSrc": "/face-roast.png",
          "description": ["Created a React app that takes a picture of the user and generates a witty 'roast' about their face for a 24 hour hackathon",
          "Trained a computer vision model to analyze the users face and output their most prominent facial features",
          "Connected GPT3 API in the backend to take the model's predicted features and generate a 'roast'"],
          "date": "Sep 2023 - Apr 2024",
          "imgSecondarySrc": "/face-roast-secondary.png",
          "tags": ["Python", "React", "GPT API"]
        },
        {
          "title": "Book Club",
          "subtitle":"Personalized Book Suggestions",
          "imgSrc": "/book-club.jpg",
          "description": ["Designed and implemented a dynamic full-stack website that employs personalized algorithms to offer book recommendations, leveraging users' historical reading patterns and ratings"],
          "date": "Sep 2023 - Apr 2024",
          "imgSecondarySrc": "/book-club-secondary.png",
          "tags": ["Node", "React", "MongoDB"]
        }
      ],
    "education": [{
        "school": "McGill University",
        "title": "B.Eng Software Engineering",
        "date": "Sep 2020 - Dec 2024",
        "gpa": "3.96/4.0",
        "imgSrc": "/mcgill.png",
        "courses": ["Algorithm Design", "Data Structures", "Database Systems", "Operating Systems", "Design Principles", "Model Programming"]
      }
    ],
    "tabs": [
      "Work Experience",
      "Projects",
      "Education"
    ],
    "socialLinks": {
      "github": "https://github.com/samvass",
      "linkedin": "https://www.linkedin.com/in/samuel-ryan-vasserman-279299200/",
      "email": "mailto:samuel-ryan.vasserman@mail.mcgill.ca",
      "CV": "https://drive.google.com/file/d/1B9OhQhTwdIjljRKW3O48W14zq3Gqrekb/view?usp=sharing"
    }
}